/*   Продумайте структуру класса Кот. Какие поля и методы будут актуальны
     для приложения, которое является
        а) информационной системой ветеринарной клиники
        б) архивом выставки котов
        в) информационной системой Театра кошек Ю. Д. Куклачёва
        Можно записать в текстовом виде, не обязательно реализовывать в java.

*/

public class Task_03 {
//    public static void main(String[] args) {
//        Cat cat1 = new Cat("Barsic");
//        cat1.setAge(10);
//
//        System.out.println(cat1);
//    }
}
